package com.yajun.green.web.utils;

/**
 * Created by LiuMengKe on 2017/8/10.
 */

public class ContactPdfTemplate {

    public static final String FONTPATH = "SIMFANG.TTF";
    public static final int BIAOTISIZE = 20;
    public static final int RULESIZE = 12;
    public static final int BODYSIZE = 12;

    public static  final String LK_CONTACTTITLE = "成都绿卡城配物流有限公司\n" + "新能源物流车租赁合同书\n\n";
    public static  final String CONTACTTITLE = "\n" + "新能源物流车租赁合同书\n\n";
    public static  final String JIAYISHANGFANG = "出租方（以下简称：甲方）：jiafangcompanyname   \n" +
            "法定代表人：jiafangfaren\n" +
            "地址：jiafangaddress   \n" +
            "邮编：jiafangpostcode\n" +
            "\n" +
            "承租方（以下简称：乙方）：companyname\n" +
            "法定代表人：faren\n" +
            "地址：address\n" +
            "邮编：postcode\n" +
            "\n" +
            "\n";

    public static  final String  YINYAN =  "   甲、乙双方根据《中华人民共和国合同法》及其相关法律法规规定，本着友好合作的原则，经双方共同协商，特订立本租赁合同，以供双方共同遵守。\n";

    public static final  String  RULE_1 = "   第一条\t 乙方向甲方租赁新能源物流车产品名称、型号如下：\n" ;

    public static final  String  RULE_2 = "   第二条 租金、租赁押金和租期\n" ;

    public static final  String  BODY_2_BUBAODIAN = "   2.1租金及租赁押金：\n" +
            "    租赁押金为￥yajinOne元/台（含违章处理押金，租赁押金担保乙方履行本合同，乙方租赁押金不得用于充抵租金），每月为租金￥zujinOne元/台（租金包括车辆使用费、车辆基本牌证费、保险费（含交强险、车身险、50万第三者责任险和2万元机动车车上人员责任保险（驾驶员和副驾驶位）、不计免赔）、租赁期间按车辆生产厂家要求正常使用的质保维护保养费）。\n" +
            "    2.2租期：租赁期限为qixian个月，即从乙方提车之日起开始计算。\n" +
            "    2.3租金和租赁押金支付方式：\n" +
            "    乙方于本合同签订之日起三日内，向甲方支付taishu台车辆租赁押金合计￥yajinTotal元（大写：人民币YjTotalFanti元整  ），及首月租金合计￥shouyuezujinHeji元（大写：人民币YZFanti元整 ），之后每月25日前支付次月应付租金。\n";
    public static final  String  BODY_2_BAODIAN = "   2.1租金及租赁押金：\n" +
            "    租赁押金为￥yajinOne元/台（含违章处理押金，租赁押金担保乙方履行本合同，乙方租赁押金不得用于充抵租金），每月为租金￥zujinOne元/台（租金包括车辆使用费、车辆基本牌证费、保险费（含交强险、车身险、50万第三者责任险和2万元机动车车上人员责任保险（驾驶员和副驾驶位）、不计免赔）、租赁期间按车辆生产厂家要求正常使用的质保维护保养费和租赁期间在甲方充电设施内的充电费用）。\n" +
            "    2.2租期：租赁期限为qixian个月，即从乙方提车之日起开始计算。\n" +
            "    2.3租金和租赁押金支付方式：\n" +
            "    乙方于本合同签订之日起三日内，向甲方支付taishu台车辆租赁押金合计￥yajinTotal元（大写：人民币YjTotalFanti元整  ），及首月租金合计￥shouyuezujinHeji元（大写：人民币YZFanti元整 ），之后每月25日前支付次月应付租金。\n";
    public static final String  RULE_3 ="   第三条　甲方的权利\n" ;
    public static final String  BODY_3 = "   3.1拥有租赁车辆所有权。\n" +
            "    3.2依照本合同约定向乙方计收租金及约定费用。\n" +
            "    3.3依照国家和成都市运管部门及安监部门的相关规定对乙方安全技术管理进行监督检查的权利。\n";
    public static final String ROLE_4 = "   第四条　甲方的义务\n" ;
    public static final String BODY_4_BUBAODIAN =
            "   4.1向乙方交付技术状况良好、设备齐全的租赁车辆，以及租赁车辆行驶所需的有效证件（含行驶证、道路运输证）及保险。\n" +
                    "    4.2甲方收到乙方支付的车辆租赁押金和首月租金后，甲方交付车辆准备完备后通知乙方接车，双方应完成租赁车辆的交付手续。交接租赁车辆时甲方应如实提供车辆状况信息，乙方应对车辆技术状况及随车营运设备、证件等进行认真检查，并如实填写车辆交接技术清单，双方签字予以确认。\n" +
                    "    4.3对乙方正常使用租赁车辆出现的故障应提供免费维修服务，并提供操作规程培训。\n" +
                    "    4.4提供成都市行政区域内故障、事故4小时内救援服务，维修、救援后租赁车辆仍无法恢复使用功能的，甲方应提供相同档次替换车辆或采取其他措施，但乙方在使用甲方提供的替换车辆期间，甲、乙双方的各项权利义务按本合同约定内容执行。\n" +
                    "    4.5对所获得的乙方信息负有保密义务。\n";
    public static final String BODY_4_BAODIAN =
            "   4.1向乙方交付技术状况良好、设备齐全的租赁车辆，以及租赁车辆行驶所需的有效证件（含行驶证、道路运输证）及保险。\n" +
                    "    4.2甲方收到乙方支付的车辆押金和首月租金后，甲方交付车辆准备完备后通知乙方接车，双方应完成租赁车辆的交付手续。交接租赁车辆时甲方应如实提供车辆状况信息，乙方应对车辆技术状况及随车营运设备、证件等进行认真检查，并如实填写车辆交接技术清单，双方签字予以确认。\n" +
                    "    4.3对乙方正常使用租赁车辆出现的故障应提供免费维修服务，并提供操作规程培训。\n" +
                    "    4.4提供成都市行政区域内故障、事故4小时内救援服务，维修、救援后租赁车辆仍无法恢复使用功能的，甲方应提供相同档次替换车辆或采取其他措施，但乙方在使用甲方提供的替换车辆期间，甲、乙双方的各项权利义务按本合同约定内容执行。\n" +
                    "    4.5对所获得的乙方信息负有保密义务。\n"+
                    "    4.6甲方充电设施在承租期内免费对乙方承租车辆提供充电和补电服务，甲方为乙方办理充电卡。\n";
    public static final String ROLE_5 = "   第五条　乙方的权利\n" ;
    public static final String BODY_5 =
            "   5.1按合同的约定拥有租赁车辆使用权。\n" +
                    "    5.2有权获知保证安全驾驶所需的车辆技术状况及性能信息。\n" +
                    "    5.3有权获得甲方为保障租赁车辆使用功能所提供的相应服务。\n";
    public static final String ROLE_6 = "   第六条　乙方的义务\n" ;
    public static final String BODY_6 =
            "   6.1如实向甲方提供乙方的营业执照、组织机构代码、税务登记证（如三证合一的，仅提供营业执照副本）、乙方驾驶人员的驾驶证件、符合要求的道路运输从业资格证、身份证，等证明资料复印件（交付复印件时甲方需查验原件）。\n" +
                    "    6.2按合同约定交纳租赁押金、租金及其他费用。\n" +
                    "    6.3按车辆性能、操作规程及相关法律、法规的规定使用租赁车辆。若不按车辆性能或操作程序使用而造成的租赁车辆毁损、修理、停运损失，由乙方承担赔偿责任。\n" +
                    "    6.4妥善保管租赁车辆，维持车辆原状。未经甲方允许，不得擅自修理车辆电动部分，不得擅自改装、更换、增设他物、不得擅自在车身等部位张贴、喷绘广告。否则，应恢复原状并赔偿甲方损失。\n" +
                    "    6.5按车辆年检、保养的要求及规定，协助甲方对租赁车辆进行车检及维修保养（正常保养、年检期间仍应计算租金），否则，应全额赔偿因延误车辆年检、保养而给甲方造成的损失。\n" +
                    "    6.6承担因交通事故造成超过保险赔付部分的损失，承担盗抢造成的租赁车辆现值损失；承担因交通事故引发的其他责任等。\n" +
                    "    6.7保护甲方车辆所有权不受侵犯，不得转卖、抵押、质押、典当、转借、转租租赁车辆。\n" +
                    "    6.8租赁车辆发生交通事故、被盗抢时，应立即向公安、交管等部门报案并在2小时内通知甲方，无条件协助甲方办理相关手续。\n" +
                    "    6.9保证租赁车辆为合同登记的驾驶员驾驶，并要求驾驶员按交通法规驾驶。在租赁期内，如乙方登记的信息发生变化，应及时通知甲方。\n" +
                    "    6.10承担承租车辆传统部分的日常保养、维修、更换与维护，如轮胎、刹车片、雨刮片和整车打黄油等一切费用。\n" +
                    "    6.11租赁期满之日，应按时返还租赁车辆及有效证件。\n" +
                    "    6.12在租赁期内发生的交通违章扣分及罚款由乙方承担费用并处理，应在交通违法之日起15个工作日内处理完毕，若乙方未在上述约定的期限内接受处罚，合同中登记的驾驶员将作为违章责任人被提交公安交通管理部门处理，同时，乙方承诺将无条件同意甲方代为处理违章，甲方因代乙方处理违章所产生的一切费用由乙方无条件认可并承担，并同意甲方从乙方交付的租车押金中全额扣除，甲方用乙方租车押金来处理违章后，甲方有权利要求乙方在一周内补足。如押金不足以处理违章，乙方又拖延不处理违章时，甲方可单方无条件终止本合同的履行，并有权立即无条件收回乙方承租的车辆，由此给甲方带来的一切损失（包括但不限于甲方新车无法上牌、承租车辆无法年检，承租车辆发生保险事故保险公司拒绝赔偿，甲方因此被运管所罚款或吊销道路运输许可证等）均由乙方承担赔偿责任。\n" +
                    "    6.13非甲方原因导致车辆被第三方扣押，由乙方全额承担责任并赔偿由此对甲方造成的损失。\n" +
                    "    6.14乙方有义务做好本公司承租车辆的安全技术管理工作，按照甲方的安全管理标准执行行业主管部门的“八簿五册一档”安全管理档案，并接受甲方定期或不定期监督检查。\n" +
                    "    6.15乙方在租赁使用甲方车辆时，若因乙方或乙方驾驶人员自身的原因导致车辆损坏或造成第三人人身、财产等受损，保险公司拒绝赔付时，所有赔偿责任均由乙方承担。\n" +
                    "    6.16若发生交通事故，乙方应在事故发生后及时通知甲方，最迟不得超过12小时，并在条件允许的情况下将车辆送达甲方指定修理厂。\n" +
                    "    6.17车辆发生保险事故，如乙方不能取得保险公司理赔必须的有关手续，则由乙方负担全部维修费用及合理的车辆折旧费，并承担不能赔付的责任。因甲方原因导致的除外。\n";
    public static final String ROLE_7 = "   第七条　意外风险\n" ;
    public static final String BODY_7 =
            "   除甲方已购买的保险由保险公司承担相应理赔责任外，对于保险公司不予赔偿的部分，或者超出保险公司赔偿的部分均由乙方承担。\n";
    public static final String ROLE_8 = "   第八条　甲方的违约责任\n" ;
    public static final String BODY_8 =
            "   除甲方已购买的保险由保险公司承担相应理赔责任外，对于保险公司不予赔偿的部分，或者超出保险公司赔偿的部分均由乙方承担。\n"+
                    "    8.1经道路运输管理部门认可专业检测机构认定，交付的租赁车辆达不到相应车辆运营标准的，乙方有权解除合同，并要求甲方承担违约责任。\n" +
                    "    8.2甲方不能按约定提供故障维修、救援时，乙方有权解除合同，甲方应退还租赁车辆停驶期间租金并支付停驶期间租金20%的违约金。\n" +
                    "    8.3维修、救援后租赁车辆仍无法恢复使用功能，甲方应提供相同档次替换车辆或采取其他措施。甲方不提供相应的替换车或采取其他措施时，由甲方承担相应的违约责任。\n";
    public static final String ROLE_9 = "   第九条　乙方的违约责任\n" ;
    public static final String BODY_9 =
            "   乙方不能按合同约定按时交纳费用、正确使用租赁车辆、保管租赁车辆、及时归还租赁车辆和处理交通违章时，应承担下列违约责任：\n" +
                    "    9.1逾期交纳租金的，每逾期一日按应交租金总额的0．5%交纳滞纳金，逾期达10日以上，甲方有权单方解除本合同，并要求乙方支付相应的滞纳金。逾期归还租赁车辆及相应手续的，除继续计收租金外，应交纳本合同租期内全额租金20%的违约金。\n" +
                    "    9.2乙方单方解除本合同，应按未履行部分租期租金总额的20%向甲方支付违约金。\n" +
                    "    9.3因乙方原因造成车辆损坏的，乙方应当承担依照汽车维修规定的标准据实支付修车费用。\n" +
                    "    9.4乙方有下列行为的，甲方有权解除合同并收回租赁车辆，并按本合同租金总额的20%追究乙方的违约责任：\n"+
                    "    （1）提供虚假信息。\n" +
                    "    （2）拖欠租金或其他费用。\n" +
                    "    （3）转卖、抵押、质押、转借、典当及转租租赁车辆或确有证据证明存在上述危险的。\n" +
                    "    （4）确有证据证明乙方利用租赁车辆从事违法犯罪活动的。\n" +
                    "    （5）企业内部安全管理体系、制度不健全的,甲方定期或不定期检查发现要求整改而拒不整改的。\n" +
                    "    9.5不按车辆性能或操作程序使用而造成的租赁车辆修理、停运损失；承担因过失被保险公司拒绝赔偿的损失。\n" +
                    "    9.6擅自改装、更换、增设他物等改变租赁车辆原状造成的损失。\n" +
                    "    9.7擅自在车身等部位张贴、喷绘广告造成的相应损失。\n" +
                    "    9.8未协助甲方按时参加车检或维修保养而造成的损失。\n" +
                    "    9.9非甲方原因导致车辆被第三方扣押的责任。\n" +
                    "    9.10违反交通安全法规时，应在交通违法之日起15个工作日内处罚完毕，若拒绝接受处罚，合同中登记的驾驶员将作为违章责任人交由公安交通管理部门处理。\n" +
                    "    9.11乙方违反本上述条款项下任何一条以及其他约定事项时，甲方有权单方无条件解除本合同并收回租赁车辆，乙方按本合同租金总额的20%向甲方承担违约责任。\n";
    public static final String ROLE_10 = "   第十条 车辆的提供及交回\n" ;
    public static final String BODY_10 =
            "   10.1甲方向乙方提供车辆时，双方应共同对车辆外观和基本使用功能等进行认真检查、确认，如有异议乙方应当场向甲方提出；乙方未提出异议，则视为甲方提供的车辆符合国家相关标准的要求；双方应共同签署交接确认书。车辆交予乙方后，由乙方承担相关风险。\n" +
                    "    10.2合同期结束之日，乙方应将车辆交还甲方，双方应根据已签署的交接确认书对车辆外观和基本使用功能等进行认真检查、确认。因乙方使用造成车辆损坏的，乙方应承担进行修复的费用；乙方拒绝修复的，甲方有权自行修复，相关费用由乙方承担并同意甲方从已交付的租车押金中扣除。如车辆有损伤或随车工具有遗失，乙方须照价赔偿甲方，但正常损耗除外。由于还车当日，甲方不能核查该使用车辆的违法违章情况，故车辆交还给甲方后的15日内，甲方有权向乙方要求支付该车辆使用期间因违法违章产生的罚款。如乙方使用过程中发生事故并报了保险，乙方需满足以下三个条件，甲方才接受车辆的退回。因乙方不及时配合处理保险理赔导致车辆不能按时收回，按超期交付的天数收取使用费，收费标准为500元/天。\n" +
                    "    （1）所报事故已通过公安交警部门备案，并已经保险公司定损；\n" +
                    "    （2）保险理赔的资料全部准备齐，且已交与甲方；\n" +
                    "    （3）所报事故造成的乙方应赔偿事故另一方的赔偿金已由乙方全部垫付。\n" +
                    "    若以上均核实无误及承租车辆违章全部处理之后，甲方应在乙方退还车辆十五个工作日退还乙方支付的租赁押金。\n";
    public static final String ROLE_11 = "   第十一条 保险相关约定\n" ;
    public static final String BODY_11 =
            "   11.1甲方所提供车辆已办理保险项目包括:交强险、车身险、50万第三者责任险和2万元机动车车上人员责任保险（驾驶员和副驾驶位）、不计免赔。\n" +
                    "    11.2车辆没有购买盗抢险、玻璃险等附加商业保险。若乙方要求增加其它保险项目时，费用由乙方承担。如果出现车辆被盗、被抢或车辆玻璃破损等事故给甲方造成的相应损失应由乙方负责赔偿。\n" +
                    "    11.3乙方如发生道路交通事故及其它原因向保险公司办理报案理赔，造成甲方保险续保费用增加，乙方应将增加的续保费用如实支付给甲方，乙方以各种理由拖延或拒不支付该费用，甲方有权利从租车押金中扣除。   \n";
    public static final String ROLE_12 = "   第十二条　特别约定\n" ;

    public static final String BODY_12_BAODIAN_ZU =
            "   12.1乙方如要求延长租期，须在合同到期前10天提出续租申请，甲方有权决定是否续租。\n" +
                    "    12.2甲方提供交流电充电桩，乙方免费提供安全合法的充电场地和电源，电价不得超过1元/度，超过部分由乙方承担。充电桩的所有权归甲方所有，乙方有优先使用权。充电桩建设的材料费和施工费由乙方承担，如乙方场地搬迁，导致此配套充电设施需搬迁，因此发生的所有费用由乙方全额承担，甲方按乙方要求在乙方指定场地建设好交流充电桩后，甲方将建设好的充电桩授权委托给乙方进行日常安全管理，因此充电桩主要为满足乙方使用而建设，乙方同意无条件免费对其进行日常安全管理，乙方承诺在充电桩交付使用之日起至报废之日止期间内产生的任何人身伤害和财产损失由其自行承担赔偿责任，甲方不承担任何责任。\n" +
                    "    12.3 租赁期内甲方免费提供给乙方每台车每年40000公里的充电服务，超出部分在乙方指定充电桩充电，充电费用由乙方承担。\n";
    public static final String BODY_12_BUBAODIAN_ZU =
            "   12.1乙方如要求延长租期，须在合同到期前10天提出续租申请，甲方有权决定是否续租。\n" ;

    public static final String BODY_12_BAODIAN_ZUZHUANSHOU =
            "   12.1甲方提供交流电充电桩，乙方提供安全合法的充电场地和电源，电价不得超过1元/度，超过部分由乙方承担。充电桩的所有权归甲方所有，乙方有优先使用权。充电桩建设的材料费和施工费由乙方承担，如乙方场地搬迁，导致此配套充电设施需搬迁，因此发生的所有费用由乙方全额承担。\n" +
                    "    12.2租赁期内甲方提供给乙方每台车每年40000公里的充电服务，超出部分在乙方指定充电桩充电，充电费用由乙方承担。\n" +
                    "    12.3若乙方自车辆交付之日起12个月内累计行驶里程达3万公里以上，可与甲方协商一致在连续租用满36个月（中途未更换过车辆）后购买该租赁车辆，购车价格为6万元/台（剩余租赁押金及违章押金可直接抵扣购车款），同时甲方给予乙方1万元/台的购车奖励，此奖励不以现金方式向乙方支付，甲方可直接在购车款中予以抵扣。乙方需在本合同到期前一个月（30日）内书面向甲方提交购车申请，双方达成一致意向的，须另行签署车辆购买协议，甲方将车辆过户给乙方，过户产生的相关费用由乙方自行承担。\n" +
                    "    12.4若乙方自车辆交付之日起12个月内累计行驶里程未达到3万公里以上，在连续租用满36个月（中途未更换过车辆）后无权享受购买租赁车辆政策。乙方可选择继续租赁，并应在合同到期前10天提出续租申请，甲方有权决定是否续租。\n";
    public static final String BODY_12_BUBAODIAN_ZUZHUANSHOU =
            "   12.1甲方提供交流电充电桩，乙方提供安全合法的充电场地和电源。充电桩的所有权归甲方所有，乙方有优先使用权。充电桩建设的材料费和施工费由乙方承担，如乙方场地搬迁，导致此配套充电设施需搬迁，因此发生的所有费用由乙方全额承担。\n" +
                    "    12.2若乙方自车辆交付之日起12个月内累计行驶里程达3万公里以上，可在连续租用满36个月（中途未更换过车辆）后与甲方协商购买租赁车辆，购车价格为6万元/台（剩余租赁押金及违章押金可直接抵扣购车款），同时甲方给予乙方1万元/台的购车奖励，此奖励不以现金方式向乙方支付，甲方可直接在购车款中予以抵扣。乙方需在本合同到期前一个月（30日）内书面向甲方提交购车申请，双方达成一致意向的，须另行签署车辆购买协议，甲方将车辆过户给乙方，过户产生的相关费用由乙方自行承担。\n" +
                    "    12.3若乙方自车辆交付之日起12个月内累计行驶里程未达到3万公里以上，在连续租用满36个月（中途未更换过车辆）后无权享受购买租赁车辆政策。乙方可选择继续租赁，并应在合同到期前10天提出续租申请，甲方有权决定是否续租。\n";



    public static final String ROLE_13 = "   第十三条 争议及解决办法\n" ;
    public static final String BODY_13 =
            "   本合同项下发生的争议，双方应协商，协商不成可向甲方所在地人民法院提起诉讼解决。\n";
    public static final String ROLE_14 = "   第十四条 合同生效、修改\n" ;
    public static final String BODY_14 =
            "   14.1甲、乙双方可对本合同内容以书面形式予以增加、细化作为补充条款，但不得违反有关法规及政策规定，不得违反公平原则。本合同经甲、乙双方签章后生效。\n" +
                    "    14.2本合同一式肆份，甲方叁份，乙方壹份，具有同等效力。\n";
    public static final String LK_JIEWEI = "\n" +
            "甲方：成都绿卡城配物流有限公司          　乙方：\n" +
            "签约代表：　　　　　　　　　　　　　　　　签约代表：\n" +
            "委托代理人：　　　　　　　　　　　　　　　委托代理人：\n" +
            "开户银行：中国建设银行成都车城支行        开户银行：\n" +
            "银行帐号：5100 1556 8660 5250 0565        银行帐号：\n" +
            "签订时间：     年    月     日            签订时间：    年    月    日\n";

    public static final String JIEWEI = "\n" +
                "甲方：jname                      　            乙方：\n" +
                "签约代表：　　　　　　　　　　　　　　　　签约代表：\n" +
                "委托代理人：　　　　　　　　　　　　　　　委托代理人：\n" +
                "开户银行：bname       开户银行：\n" +
                "银行帐号：bnumber       银行帐号：\n" +
                "签订时间：     年    月     日            签订时间：    年    月    日\n";

}
